sulaolab/dspic33ak-i2c-hal/src/dspic33ak_i2c.c
#include "dspic33ak_i2c.h"
#include "dspic33ak_i2c_device.h"
#include "dspic33ak_i2c_reg.h"

/* --------------------------------------------------------------------------
 * Module state
 * -------------------------------------------------------------------------- */

typedef enum {
    DSPIC33AK_I2C_PENDING_NONE = 0,
    DSPIC33AK_I2C_PENDING_MASTER_WRITE
} dspic33ak_i2c_pending_state_t;

static uint32_t g_timeout_ms[DSPIC33AK_I2C_INST_COUNT];
static dspic33ak_i2c_get_ms_fn g_get_ms[DSPIC33AK_I2C_INST_COUNT];
static bool g_initialized[DSPIC33AK_I2C_INST_COUNT];
static dspic33ak_i2c_pending_state_t g_pending_state[DSPIC33AK_I2C_INST_COUNT];
static uint32_t g_pending_start_ms[DSPIC33AK_I2C_INST_COUNT];
static uint32_t g_pending_timeout_ms[DSPIC33AK_I2C_INST_COUNT];

/* --------------------------------------------------------------------------
 * Local helper prototypes
 *
 * The implementation body is ordered for readability:
 *   1. Normal blocking API
 *   2. Low-level global API
 *   3. Static local helper functions
 * -------------------------------------------------------------------------- */

static bool inst_is_valid(dspic33ak_i2c_instance_t inst);
static dspic33ak_i2c_status_t get_regs(
    dspic33ak_i2c_instance_t inst,
    const dspic33ak_i2c_regs_t **regs);
static dspic33ak_i2c_status_t require_initialized(
    dspic33ak_i2c_instance_t inst,
    const dspic33ak_i2c_regs_t **regs);
static dspic33ak_i2c_status_t check_initialized(dspic33ak_i2c_instance_t inst);
static uint32_t calc_brg(uint32_t fcy_hz, uint32_t bus_hz);
static bool timeout_enabled(dspic33ak_i2c_instance_t inst);
static uint32_t timeout_start_ms(dspic33ak_i2c_instance_t inst);
static bool timeout_expired(dspic33ak_i2c_instance_t inst, uint32_t start_ms);
static bool pending_timeout_enabled(dspic33ak_i2c_instance_t inst);
static bool pending_timeout_expired(dspic33ak_i2c_instance_t inst);
static void pending_clear(dspic33ak_i2c_instance_t inst);
static void pending_set(
    dspic33ak_i2c_instance_t inst,
    dspic33ak_i2c_pending_state_t state);
static dspic33ak_i2c_status_t recover_stale_pending_if_needed(
    dspic33ak_i2c_instance_t inst);
static dspic33ak_i2c_status_t begin_independent_transaction(
    dspic33ak_i2c_instance_t inst);
static dspic33ak_i2c_status_t write_no_stop_sequence(
    dspic33ak_i2c_instance_t inst,
    uint8_t addr7,
    const uint8_t *tx,
    size_t tx_len);
static dspic33ak_i2c_status_t read_after_restart_sequence(
    dspic33ak_i2c_instance_t inst,
    uint8_t addr7,
    uint8_t *rx,
    size_t rx_len);
static dspic33ak_i2c_status_t stop_pending_sequence(
    dspic33ak_i2c_instance_t inst);
static dspic33ak_i2c_status_t abort_pending_sequence(
    dspic33ak_i2c_instance_t inst,
    dspic33ak_i2c_status_t original_status);
static void clear_transfer_status(const dspic33ak_i2c_regs_t *r);
static dspic33ak_i2c_status_t check_bus_fault(dspic33ak_i2c_instance_t inst);
static dspic33ak_i2c_status_t wait_until(
    dspic33ak_i2c_instance_t inst,
    bool (*done_fn)(dspic33ak_i2c_instance_t),
    bool check_nack);
static bool host_active(dspic33ak_i2c_instance_t inst);
static bool write_byte_ready(dspic33ak_i2c_instance_t inst);
static bool write_byte_done(dspic33ak_i2c_instance_t inst);
static bool write_data_accepted(dspic33ak_i2c_instance_t inst);
static bool ack_done(dspic33ak_i2c_instance_t inst);
static bool stop_fully_done(dspic33ak_i2c_instance_t inst);
static dspic33ak_i2c_status_t stop_quiet(dspic33ak_i2c_instance_t inst);
static dspic33ak_i2c_status_t start_blocking(dspic33ak_i2c_instance_t inst);
static dspic33ak_i2c_status_t restart_blocking(dspic33ak_i2c_instance_t inst);
static dspic33ak_i2c_status_t write_byte_blocking(
    dspic33ak_i2c_instance_t inst,
    uint8_t data);
static dspic33ak_i2c_status_t read_byte_blocking(
    dspic33ak_i2c_instance_t inst,
    uint8_t *data,
    bool ack);
static dspic33ak_i2c_status_t send_address_blocking(
    dspic33ak_i2c_instance_t inst,
    uint8_t addr7,
    bool read);

/* ========================================================================== */
/* 1. Normal blocking API                                                     */
/* ========================================================================== */

/* --------------------------------------------------------------------------
 * Initialize I2C instance
 * -------------------------------------------------------------------------- */
dspic33ak_i2c_status_t dspic33ak_i2c_init(
    dspic33ak_i2c_instance_t inst,
    const dspic33ak_i2c_config_t *config)
{
    const dspic33ak_i2c_regs_t *r;
    dspic33ak_i2c_status_t st;
    uint32_t brg;

    if (!inst_is_valid(inst)) {
        return DSPIC33AK_I2C_ERR_INVALID_ARG;
    }

    if (config == 0 || config->fcy_hz == 0u || config->bus_hz == 0u) {
        return DSPIC33AK_I2C_ERR_INVALID_ARG;
    }

    st = get_regs(inst, &r);
    if (st != DSPIC33AK_I2C_OK) {
        return st;
    }

    *r->CON1 = 0x00001000u;
    *r->CON2 = 0x00000001u;
    clear_transfer_status(r);

    dspic33ak_i2c_reg_set(r->CON2, DSPIC33AK_I2C_CON2_BITE);
    dspic33ak_i2c_reg_write_field(r->BITO,
                                   DSPIC33AK_I2C_BITO_BITOTMR_MASK,
                                   76u);

    brg = calc_brg(config->fcy_hz, config->bus_hz);

    /* LBRG and HBRG are equal for a simple 50% duty-cycle SCL setup. */
    *r->LBRG = brg;
    *r->HBRG = brg;

    g_timeout_ms[inst] = config->timeout_ms;
    g_get_ms[inst] = config->get_ms;
    g_pending_timeout_ms[inst] = config->pending_timeout_ms;
    pending_clear(inst);
    g_initialized[inst] = true;

    dspic33ak_i2c_reg_set(r->CON1, DSPIC33AK_I2C_CON1_ON);

    return DSPIC33AK_I2C_OK;
}

/* --------------------------------------------------------------------------
 * Deinitialize I2C instance
 * -------------------------------------------------------------------------- */
dspic33ak_i2c_status_t dspic33ak_i2c_deinit(
    dspic33ak_i2c_instance_t inst)
{
    const dspic33ak_i2c_regs_t *r;
    dspic33ak_i2c_status_t st;

