sulaolab/dspic33ak-i2c-hal/src/dspic33ak_i2c.c
    if (!inst_is_valid(inst)) {
        return DSPIC33AK_I2C_ERR_INVALID_ARG;
    }

    st = get_regs(inst, &r);
    if (st != DSPIC33AK_I2C_OK) {
        return st;
    }

    st = recover_stale_pending_if_needed(inst);
    if (st != DSPIC33AK_I2C_OK &&
        st != DSPIC33AK_I2C_ERR_TIMEOUT &&
        st != DSPIC33AK_I2C_ERR_BUS &&
        st != DSPIC33AK_I2C_ERR_COLLISION) {
        return st;
    }

    if (st == DSPIC33AK_I2C_OK &&
        g_pending_state[inst] == DSPIC33AK_I2C_PENDING_NONE) {
        if (dspic33ak_i2c_reg_is_set(r->STAT2, DSPIC33AK_I2C_STAT2_HSTACT) ||
            dspic33ak_i2c_reg_is_set(r->STAT1, DSPIC33AK_I2C_STAT1_TRSTAT) ||
            dspic33ak_i2c_reg_is_set(r->CON1,
                                      DSPIC33AK_I2C_CON1_SEN |
                                      DSPIC33AK_I2C_CON1_RSEN |
                                      DSPIC33AK_I2C_CON1_PEN |
                                      DSPIC33AK_I2C_CON1_RCEN |
                                      DSPIC33AK_I2C_CON1_ACKEN)) {
            return DSPIC33AK_I2C_ERR_BUSY;
        }
    }

    /*
     * If a pending transaction is still latched, deinit is the explicit
     * recovery path.  Force the peripheral and HAL state off instead of
     * leaving the caller with no way out when pending timeout is disabled.
     */
    dspic33ak_i2c_reg_clear(r->CON1, DSPIC33AK_I2C_CON1_ON);

    g_timeout_ms[inst] = 0u;
    g_get_ms[inst] = 0;
    g_pending_timeout_ms[inst] = 0u;
    pending_clear(inst);
    g_initialized[inst] = false;

    return st;
}

/* --------------------------------------------------------------------------
 * Update bus speed on an initialized idle instance
 * -------------------------------------------------------------------------- */
dspic33ak_i2c_status_t dspic33ak_i2c_set_bus_speed(
    dspic33ak_i2c_instance_t inst,
    uint32_t fcy_hz,
    uint32_t bus_hz)
{
    const dspic33ak_i2c_regs_t *r;
    dspic33ak_i2c_status_t st;
    uint32_t brg;
    bool was_on;

    if (!inst_is_valid(inst)) {
        return DSPIC33AK_I2C_ERR_INVALID_ARG;
    }

    if (fcy_hz == 0u || bus_hz == 0u) {
        return DSPIC33AK_I2C_ERR_INVALID_ARG;
    }

    st = require_initialized(inst, &r);
    if (st != DSPIC33AK_I2C_OK) {
        return st;
    }

    /*
     * Do not run stale pending recovery here.  A pending no-STOP transaction
     * simply blocks the speed change; recovery stays the responsibility of the
     * read-after-restart / stop / deinit paths.
     */
    if (g_pending_state[inst] != DSPIC33AK_I2C_PENDING_NONE) {
        return DSPIC33AK_I2C_ERR_BUSY;
    }

    /*
     * host_active() only inspects STAT2.HSTACT.  Reject the speed change while
     * any START / repeated-START / STOP / receive / ACK request bit is still
     * set or a byte transfer is in progress, mirroring the idle check used by
     * deinit.
     */
    if (host_active(inst) ||
        dspic33ak_i2c_reg_is_set(r->STAT1, DSPIC33AK_I2C_STAT1_TRSTAT) ||
        dspic33ak_i2c_reg_is_set(r->CON1,
                                  DSPIC33AK_I2C_CON1_SEN |
                                  DSPIC33AK_I2C_CON1_RSEN |
                                  DSPIC33AK_I2C_CON1_PEN |
                                  DSPIC33AK_I2C_CON1_RCEN |
                                  DSPIC33AK_I2C_CON1_ACKEN)) {
        return DSPIC33AK_I2C_ERR_BUSY;
    }

    brg = calc_brg(fcy_hz, bus_hz);

    /*
     * Safe-side update: turn the peripheral off while LBRG/HBRG change, then
     * restore the previous ON state.
     */
    was_on = dspic33ak_i2c_reg_is_set(r->CON1, DSPIC33AK_I2C_CON1_ON);
    if (was_on) {
        dspic33ak_i2c_reg_clear(r->CON1, DSPIC33AK_I2C_CON1_ON);
    }

    *r->LBRG = brg;
    *r->HBRG = brg;

    if (was_on) {
        dspic33ak_i2c_reg_set(r->CON1, DSPIC33AK_I2C_CON1_ON);
    }

    return DSPIC33AK_I2C_OK;
}

/* --------------------------------------------------------------------------
 * Check whether I2C instance exists on the selected device
 * -------------------------------------------------------------------------- */
bool dspic33ak_i2c_is_present(dspic33ak_i2c_instance_t inst)
{
    return dspic33ak_i2c_instance_is_present(inst);
}

/* --------------------------------------------------------------------------
 * Check whether I2C instance has been initialized
 * -------------------------------------------------------------------------- */
bool dspic33ak_i2c_is_initialized(dspic33ak_i2c_instance_t inst)
{
    if (!inst_is_valid(inst)) {
        return false;
    }

    return g_initialized[inst];
}

/* --------------------------------------------------------------------------
 * Blocking write transaction
 * -------------------------------------------------------------------------- */
dspic33ak_i2c_status_t dspic33ak_i2c_write(
    dspic33ak_i2c_instance_t inst,
    uint8_t addr7,
    const uint8_t *tx,
    size_t tx_len)
{
    dspic33ak_i2c_status_t st;

    if (tx_len != 0u && tx == 0) {
        return DSPIC33AK_I2C_ERR_INVALID_ARG;
    }

    st = begin_independent_transaction(inst);
    if (st != DSPIC33AK_I2C_OK) {
        return st;
    }

    st = write_no_stop_sequence(inst, addr7, tx, tx_len);
    if (st != DSPIC33AK_I2C_OK) {
        return st;
    }

    return stop_pending_sequence(inst);
}

/* --------------------------------------------------------------------------
 * Blocking read transaction
 * -------------------------------------------------------------------------- */
dspic33ak_i2c_status_t dspic33ak_i2c_read(
    dspic33ak_i2c_instance_t inst,
    uint8_t addr7,
    uint8_t *rx,
    size_t rx_len)
{
    dspic33ak_i2c_status_t st;
    size_t i;

    if (rx == 0 || rx_len == 0u) {
        return DSPIC33AK_I2C_ERR_INVALID_ARG;
    }

    st = begin_independent_transaction(inst);
    if (st != DSPIC33AK_I2C_OK) {
        return st;
    }

    st = start_blocking(inst);
    if (st != DSPIC33AK_I2C_OK) {
        (void)stop_quiet(inst);
        return st;
    }

    st = send_address_blocking(inst, addr7, true);
    if (st != DSPIC33AK_I2C_OK) {
        (void)stop_quiet(inst);
        return st;
    }

    for (i = 0u; i < rx_len; i++) {
        bool ack = ((i + 1u) < rx_len);
        st = read_byte_blocking(inst, &rx[i], ack);
        if (st != DSPIC33AK_I2C_OK) {
            (void)stop_quiet(inst);
            return st;
        }
    }

    return stop_quiet(inst);
}

/* --------------------------------------------------------------------------
 * Blocking write-read transaction with repeated START
 * -------------------------------------------------------------------------- */
dspic33ak_i2c_status_t dspic33ak_i2c_write_read(
    dspic33ak_i2c_instance_t inst,
    uint8_t addr7,
    const uint8_t *tx,
    size_t tx_len,
    uint8_t *rx,
    size_t rx_len)
{
    dspic33ak_i2c_status_t st;

