sulaolab/dspic33ak-i2c-hal/src/dspic33ak_i2c.c
    if ((tx_len != 0u && tx == 0) || rx == 0 || rx_len == 0u) {
        return DSPIC33AK_I2C_ERR_INVALID_ARG;
    }

    st = begin_independent_transaction(inst);
    if (st != DSPIC33AK_I2C_OK) {
        return st;
    }

    st = write_no_stop_sequence(inst, addr7, tx, tx_len);
    if (st != DSPIC33AK_I2C_OK) {
        return st;
    }

    return read_after_restart_sequence(inst, addr7, rx, rx_len);
}

/* --------------------------------------------------------------------------
 * Blocking master write transaction without STOP
 * -------------------------------------------------------------------------- */
dspic33ak_i2c_status_t dspic33ak_i2c_master_write_no_stop(
    dspic33ak_i2c_instance_t inst,
    uint8_t addr7,
    const uint8_t *tx,
    size_t tx_len)
{
    dspic33ak_i2c_status_t st;

    if (tx_len != 0u && tx == 0) {
        return DSPIC33AK_I2C_ERR_INVALID_ARG;
    }

    st = begin_independent_transaction(inst);
    if (st != DSPIC33AK_I2C_OK) {
        return st;
    }

    return write_no_stop_sequence(inst, addr7, tx, tx_len);
}

/* --------------------------------------------------------------------------
 * Blocking master read after repeated START from a pending write
 * -------------------------------------------------------------------------- */
dspic33ak_i2c_status_t dspic33ak_i2c_master_read_after_restart(
    dspic33ak_i2c_instance_t inst,
    uint8_t addr7,
    uint8_t *rx,
    size_t rx_len)
{
    dspic33ak_i2c_status_t st;

    if (rx == 0 || rx_len == 0u) {
        return DSPIC33AK_I2C_ERR_INVALID_ARG;
    }

    st = recover_stale_pending_if_needed(inst);
    if (st != DSPIC33AK_I2C_OK) {
        return st;
    }

    if (g_pending_state[inst] != DSPIC33AK_I2C_PENDING_MASTER_WRITE) {
        return DSPIC33AK_I2C_ERR_SEQUENCE;
    }

    return read_after_restart_sequence(inst, addr7, rx, rx_len);
}

/* --------------------------------------------------------------------------
 * Blocking master STOP for an explicit pending transaction end
 * -------------------------------------------------------------------------- */
dspic33ak_i2c_status_t dspic33ak_i2c_master_stop(
    dspic33ak_i2c_instance_t inst)
{
    dspic33ak_i2c_status_t st;

    st = recover_stale_pending_if_needed(inst);
    if (st != DSPIC33AK_I2C_OK) {
        return st;
    }

    if (g_pending_state[inst] == DSPIC33AK_I2C_PENDING_NONE) {
        return DSPIC33AK_I2C_ERR_SEQUENCE;
    }

    return stop_pending_sequence(inst);
}

/* ========================================================================== */
/* 2. Low-level global API                                                    */
/* ========================================================================== */

/* --------------------------------------------------------------------------
 * Issue START condition
 * -------------------------------------------------------------------------- */
dspic33ak_i2c_status_t dspic33ak_i2c_ll_start_issue(
    dspic33ak_i2c_instance_t inst)
{
    const dspic33ak_i2c_regs_t *r;
    dspic33ak_i2c_status_t st = require_initialized(inst, &r);

    if (st != DSPIC33AK_I2C_OK) {
        return st;
    }

    clear_transfer_status(r);
    dspic33ak_i2c_reg_set(r->CON1, DSPIC33AK_I2C_CON1_SEN);
    return DSPIC33AK_I2C_OK;
}

/* --------------------------------------------------------------------------
 * Check START busy flag
 * -------------------------------------------------------------------------- */
bool dspic33ak_i2c_ll_start_busy(dspic33ak_i2c_instance_t inst)
{
    const dspic33ak_i2c_regs_t *r;

    if (get_regs(inst, &r) != DSPIC33AK_I2C_OK) {
        return false;
    }

    return dspic33ak_i2c_reg_is_set(r->CON1, DSPIC33AK_I2C_CON1_SEN);
}

/* --------------------------------------------------------------------------
 * Check START done status
 * -------------------------------------------------------------------------- */
bool dspic33ak_i2c_ll_start_done(dspic33ak_i2c_instance_t inst)
{
    const dspic33ak_i2c_regs_t *r;

    if (get_regs(inst, &r) != DSPIC33AK_I2C_OK) {
        return false;
    }

    return dspic33ak_i2c_reg_is_set(r->STAT2, DSPIC33AK_I2C_STAT2_STARTE) ||
           dspic33ak_i2c_reg_is_set(r->STAT1, DSPIC33AK_I2C_STAT1_S);
}

/* --------------------------------------------------------------------------
 * Issue repeated START condition
 * -------------------------------------------------------------------------- */
dspic33ak_i2c_status_t dspic33ak_i2c_ll_restart_issue(
    dspic33ak_i2c_instance_t inst)
{
    const dspic33ak_i2c_regs_t *r;
    dspic33ak_i2c_status_t st = require_initialized(inst, &r);

    if (st != DSPIC33AK_I2C_OK) {
        return st;
    }

    /*
     * Issue a repeated START condition.
     *
     * A repeated START is a START condition generated without a preceding
     * STOP.  Use RSEN so this low-level API maps directly to the dsPIC33AK
     * repeated-START request bit.
     */
    dspic33ak_i2c_reg_clear(r->STAT2, DSPIC33AK_I2C_STAT2_STARTE);
    dspic33ak_i2c_reg_set(r->CON1, DSPIC33AK_I2C_CON1_RSEN);
    return DSPIC33AK_I2C_OK;
}

/* --------------------------------------------------------------------------
 * Check repeated START busy flag
 * -------------------------------------------------------------------------- */
bool dspic33ak_i2c_ll_restart_busy(dspic33ak_i2c_instance_t inst)
{
    const dspic33ak_i2c_regs_t *r;

    if (get_regs(inst, &r) != DSPIC33AK_I2C_OK) {
        return false;
    }

    return dspic33ak_i2c_reg_is_set(r->CON1, DSPIC33AK_I2C_CON1_RSEN);
}

/* --------------------------------------------------------------------------
 * Check repeated START done status
 * -------------------------------------------------------------------------- */
bool dspic33ak_i2c_ll_restart_done(dspic33ak_i2c_instance_t inst)
{
    const dspic33ak_i2c_regs_t *r;

    if (get_regs(inst, &r) != DSPIC33AK_I2C_OK) {
        return false;
    }

    /*
     * STARTE is cleared before issuing RSEN, then checked again here.
     * STAT1.S alone is not sufficient for repeated START completion because
     * it may already be set by the previous START condition.
     */
    return !dspic33ak_i2c_reg_is_set(r->CON1, DSPIC33AK_I2C_CON1_RSEN) &&
            dspic33ak_i2c_reg_is_set(r->STAT2, DSPIC33AK_I2C_STAT2_STARTE);
}

/* --------------------------------------------------------------------------
 * Issue STOP condition
 * -------------------------------------------------------------------------- */
dspic33ak_i2c_status_t dspic33ak_i2c_ll_stop_issue(
    dspic33ak_i2c_instance_t inst)
{
    const dspic33ak_i2c_regs_t *r;
    dspic33ak_i2c_status_t st = require_initialized(inst, &r);

    if (st != DSPIC33AK_I2C_OK) {
        return st;
    }

    dspic33ak_i2c_reg_clear(r->STAT2, DSPIC33AK_I2C_STAT2_STOPE);
    dspic33ak_i2c_reg_set(r->CON1, DSPIC33AK_I2C_CON1_PEN);
    return DSPIC33AK_I2C_OK;
}

/* --------------------------------------------------------------------------
 * Check STOP busy flag
 * -------------------------------------------------------------------------- */
bool dspic33ak_i2c_ll_stop_busy(dspic33ak_i2c_instance_t inst)
{
    const dspic33ak_i2c_regs_t *r;

    if (get_regs(inst, &r) != DSPIC33AK_I2C_OK) {
        return false;
    }

    return dspic33ak_i2c_reg_is_set(r->CON1, DSPIC33AK_I2C_CON1_PEN);
}

/* --------------------------------------------------------------------------
 * Check STOP done status
 * -------------------------------------------------------------------------- */
bool dspic33ak_i2c_ll_stop_done(dspic33ak_i2c_instance_t inst)
{
    const dspic33ak_i2c_regs_t *r;

    if (get_regs(inst, &r) != DSPIC33AK_I2C_OK) {
        return false;
    }

