sulaolab/dspic33ak-i2c-hal/src/dspic33ak_i2c.c
    if (!inst_is_valid(inst)) {
        return DSPIC33AK_I2C_ERR_INVALID_ARG;
    }

    dev = dspic33ak_i2c_get_device(inst);
    if (dev == 0) {
        return DSPIC33AK_I2C_ERR_NOT_PRESENT;
    }

    *regs = &dev->regs;
    return DSPIC33AK_I2C_OK;
}

/* --------------------------------------------------------------------------
 * Resolve registers and require initialized state
 * -------------------------------------------------------------------------- */
static dspic33ak_i2c_status_t require_initialized(
    dspic33ak_i2c_instance_t inst,
    const dspic33ak_i2c_regs_t **regs)
{
    dspic33ak_i2c_status_t st;

    if (!inst_is_valid(inst)) {
        return DSPIC33AK_I2C_ERR_INVALID_ARG;
    }

    st = get_regs(inst, regs);
    if (st != DSPIC33AK_I2C_OK) {
        return st;
    }

    if (!g_initialized[inst]) {
        return DSPIC33AK_I2C_ERR_NOT_INITIALIZED;
    }

    return DSPIC33AK_I2C_OK;
}

/* --------------------------------------------------------------------------
 * Require initialized state without exposing register pointer to caller
 * -------------------------------------------------------------------------- */
static dspic33ak_i2c_status_t check_initialized(dspic33ak_i2c_instance_t inst)
{
    const dspic33ak_i2c_regs_t *r;
    return require_initialized(inst, &r);
}

/* --------------------------------------------------------------------------
 * Calculate BRG value
 * -------------------------------------------------------------------------- */
static uint32_t calc_brg(uint32_t fcy_hz, uint32_t bus_hz)
{
    uint64_t div;

    if (bus_hz == 0u) {
        return 0u;
    }

    /*
     * Round to the nearest divider while using 64-bit arithmetic to avoid
     * uint32_t overflow in fcy_hz + bus_hz on future faster devices.
     */
    div = ((uint64_t)fcy_hz + (uint64_t)bus_hz) /
          (2ull * (uint64_t)bus_hz);

    if (div == 0ull) {
        return 0u;
    }

    return (uint32_t)(div - 1ull);
}

/* --------------------------------------------------------------------------
 * Check whether timeout is enabled
 * -------------------------------------------------------------------------- */
static bool timeout_enabled(dspic33ak_i2c_instance_t inst)
{
    return inst_is_valid(inst) &&
           (g_get_ms[inst] != 0) &&
           (g_timeout_ms[inst] != 0u);
}

/* --------------------------------------------------------------------------
 * Capture timeout start tick
 * -------------------------------------------------------------------------- */
static uint32_t timeout_start_ms(dspic33ak_i2c_instance_t inst)
{
    if (!timeout_enabled(inst)) {
        return 0u;
    }

    return g_get_ms[inst]();
}

/* --------------------------------------------------------------------------
 * Check timeout expiration
 * -------------------------------------------------------------------------- */
static bool timeout_expired(dspic33ak_i2c_instance_t inst, uint32_t start_ms)
{
    uint32_t now;

    if (!timeout_enabled(inst)) {
        return false;
    }

    now = g_get_ms[inst]();
    return ((uint32_t)(now - start_ms) >= g_timeout_ms[inst]);
}

/* --------------------------------------------------------------------------
 * Check whether pending transaction timeout is enabled
 * -------------------------------------------------------------------------- */
static bool pending_timeout_enabled(dspic33ak_i2c_instance_t inst)
{
    return inst_is_valid(inst) &&
           (g_get_ms[inst] != 0) &&
           (g_pending_timeout_ms[inst] != 0u);
}

/* --------------------------------------------------------------------------
 * Check pending transaction timeout expiration
 * -------------------------------------------------------------------------- */
static bool pending_timeout_expired(dspic33ak_i2c_instance_t inst)
{
    uint32_t now;

    if (g_pending_state[inst] == DSPIC33AK_I2C_PENDING_NONE) {
        return false;
    }

    if (!pending_timeout_enabled(inst)) {
        return false;
    }

    now = g_get_ms[inst]();
    return ((uint32_t)(now - g_pending_start_ms[inst]) >=
            g_pending_timeout_ms[inst]);
}

/* --------------------------------------------------------------------------
 * Clear pending transaction state
 * -------------------------------------------------------------------------- */
static void pending_clear(dspic33ak_i2c_instance_t inst)
{
    if (!inst_is_valid(inst)) {
        return;
    }

    g_pending_state[inst] = DSPIC33AK_I2C_PENDING_NONE;
    g_pending_start_ms[inst] = 0u;
}

/* --------------------------------------------------------------------------
 * Set pending transaction state
 * -------------------------------------------------------------------------- */
static void pending_set(
    dspic33ak_i2c_instance_t inst,
    dspic33ak_i2c_pending_state_t state)
{
    if (!inst_is_valid(inst)) {
        return;
    }

    g_pending_state[inst] = state;
    g_pending_start_ms[inst] = pending_timeout_enabled(inst) ?
                               g_get_ms[inst]() :
                               0u;
}

/* --------------------------------------------------------------------------
 * Recover a stale no-STOP transaction if its pending timeout has elapsed
 * -------------------------------------------------------------------------- */
static dspic33ak_i2c_status_t recover_stale_pending_if_needed(
    dspic33ak_i2c_instance_t inst)
{
    dspic33ak_i2c_status_t st;

    st = check_initialized(inst);
    if (st != DSPIC33AK_I2C_OK) {
        return st;
    }

    if (!pending_timeout_expired(inst)) {
        return DSPIC33AK_I2C_OK;
    }

    st = stop_quiet(inst);
    if (st != DSPIC33AK_I2C_OK) {
        return st;
    }

    pending_clear(inst);
    return DSPIC33AK_I2C_ERR_TIMEOUT;
}

/* --------------------------------------------------------------------------
 * Public API guard for starting a new non-pending transaction
 * -------------------------------------------------------------------------- */
static dspic33ak_i2c_status_t begin_independent_transaction(
    dspic33ak_i2c_instance_t inst)
{
    dspic33ak_i2c_status_t st;

