sulaolab/dspic33ak-i2c-hal/src/dspic33ak_i2c.c
    /*
     * recover_stale_pending_if_needed() returns ERR_TIMEOUT when it had to
     * force a stale no-STOP transaction closed.  Propagate it: the caller
     * must observe that its previous transaction was recovered and retry,
     * rather than have a fresh transfer silently started in its place.
     */
    st = recover_stale_pending_if_needed(inst);
    if (st != DSPIC33AK_I2C_OK) {
        return st;
    }

    if (g_pending_state[inst] != DSPIC33AK_I2C_PENDING_NONE) {
        return DSPIC33AK_I2C_ERR_BUSY;
    }

    return DSPIC33AK_I2C_OK;
}

/* --------------------------------------------------------------------------
 * Internal master write sequence that intentionally leaves STOP pending
 * -------------------------------------------------------------------------- */
static dspic33ak_i2c_status_t write_no_stop_sequence(
    dspic33ak_i2c_instance_t inst,
    uint8_t addr7,
    const uint8_t *tx,
    size_t tx_len)
{
    dspic33ak_i2c_status_t st;
    size_t i;

    st = start_blocking(inst);
    if (st != DSPIC33AK_I2C_OK) {
        (void)stop_quiet(inst);
        return st;
    }

    st = send_address_blocking(inst, addr7, false);
    if (st != DSPIC33AK_I2C_OK) {
        (void)stop_quiet(inst);
        return st;
    }

    for (i = 0u; i < tx_len; i++) {
        st = write_byte_blocking(inst, tx[i]);
        if (st != DSPIC33AK_I2C_OK) {
            (void)stop_quiet(inst);
            return st;
        }
    }

    pending_set(inst, DSPIC33AK_I2C_PENDING_MASTER_WRITE);
    return DSPIC33AK_I2C_OK;
}

/* --------------------------------------------------------------------------
 * Internal repeated START read sequence from a pending write
 * -------------------------------------------------------------------------- */
static dspic33ak_i2c_status_t read_after_restart_sequence(
    dspic33ak_i2c_instance_t inst,
    uint8_t addr7,
    uint8_t *rx,
    size_t rx_len)
{
    dspic33ak_i2c_status_t st;
    size_t i;

    st = restart_blocking(inst);
    if (st != DSPIC33AK_I2C_OK) {
        return abort_pending_sequence(inst, st);
    }

    st = send_address_blocking(inst, addr7, true);
    if (st != DSPIC33AK_I2C_OK) {
        return abort_pending_sequence(inst, st);
    }

    for (i = 0u; i < rx_len; i++) {
        bool ack = ((i + 1u) < rx_len);
        st = read_byte_blocking(inst, &rx[i], ack);
        if (st != DSPIC33AK_I2C_OK) {
            return abort_pending_sequence(inst, st);
        }
    }

    return stop_pending_sequence(inst);
}

/* --------------------------------------------------------------------------
 * Internal STOP sequence for a known pending transaction
 * -------------------------------------------------------------------------- */
static dspic33ak_i2c_status_t stop_pending_sequence(
    dspic33ak_i2c_instance_t inst)
{
    dspic33ak_i2c_status_t st;

    /*
     * Clear the pending state only once STOP has actually completed.  If STOP
     * fails the bus is not cleanly released, so keep the transaction pending:
     * the next public call is then rejected with ERR_BUSY (or recovered by the
     * pending timeout) instead of starting a new transfer on a stuck bus.
     */
    st = stop_quiet(inst);
    if (st != DSPIC33AK_I2C_OK) {
        return st;
    }

    pending_clear(inst);
    return DSPIC33AK_I2C_OK;
}

/* --------------------------------------------------------------------------
 * Try to STOP after a pending transaction error
 * -------------------------------------------------------------------------- */
static dspic33ak_i2c_status_t abort_pending_sequence(
    dspic33ak_i2c_instance_t inst,
    dspic33ak_i2c_status_t original_status)
{
    dspic33ak_i2c_status_t stop_status;

    /*
     * Best-effort STOP after a failed transfer.  If STOP itself fails the bus
     * is not recovered, so surface the STOP error and keep the transaction
     * pending so the caller can tell that recovery did not complete.  Only on
     * a clean STOP do we clear the pending state and return the original
     * transfer error (e.g. ERR_NACK) as the diagnostic result.
     */
    stop_status = stop_quiet(inst);
    if (stop_status != DSPIC33AK_I2C_OK) {
        return stop_status;
    }

    pending_clear(inst);
    return original_status;
}

/* --------------------------------------------------------------------------
 * Clear transfer-related status bits
 * -------------------------------------------------------------------------- */
static void clear_transfer_status(const dspic33ak_i2c_regs_t *r)
{
    /*
     * Keep status cleanup narrow.  Do not blindly write zero to all status
     * bits; only clear the bits used by this readable driver.
     */
    dspic33ak_i2c_reg_clear(r->STAT1,
                            DSPIC33AK_I2C_STAT1_IWCOL |
                            DSPIC33AK_I2C_STAT1_I2COV |
                            DSPIC33AK_I2C_STAT1_BCL);
    dspic33ak_i2c_reg_clear(r->STAT2,
                            DSPIC33AK_I2C_STAT2_ERR |
                            DSPIC33AK_I2C_STAT2_STARTE |
                            DSPIC33AK_I2C_STAT2_STOPE |
                            DSPIC33AK_I2C_STAT2_NACKE);
}

/* --------------------------------------------------------------------------
 * Convert bus fault status to driver status
 * -------------------------------------------------------------------------- */
static dspic33ak_i2c_status_t check_bus_fault(dspic33ak_i2c_instance_t inst)
{
    if (dspic33ak_i2c_ll_has_collision(inst)) {
        return DSPIC33AK_I2C_ERR_COLLISION;
    }

    if (dspic33ak_i2c_ll_has_nack(inst)) {
        return DSPIC33AK_I2C_ERR_NACK;
    }

    if (dspic33ak_i2c_ll_has_error(inst)) {
        return DSPIC33AK_I2C_ERR_BUS;
    }

    return DSPIC33AK_I2C_OK;
}

/* --------------------------------------------------------------------------
 * Wait for condition using optional timeout
 * -------------------------------------------------------------------------- */
static dspic33ak_i2c_status_t wait_until(
    dspic33ak_i2c_instance_t inst,
    bool (*done_fn)(dspic33ak_i2c_instance_t),
    bool check_nack)
{
    uint32_t start_ms = timeout_start_ms(inst);
    dspic33ak_i2c_status_t st;

    while (!done_fn(inst)) {
        if (check_nack) {
            st = check_bus_fault(inst);
        } else {
            if (dspic33ak_i2c_ll_has_collision(inst)) {
                st = DSPIC33AK_I2C_ERR_COLLISION;
            } else if (dspic33ak_i2c_ll_has_error(inst)) {
                st = DSPIC33AK_I2C_ERR_BUS;
            } else {
                st = DSPIC33AK_I2C_OK;
            }
        }

        if (st != DSPIC33AK_I2C_OK) {
            return st;
        }

        if (timeout_expired(inst, start_ms)) {
            return DSPIC33AK_I2C_ERR_TIMEOUT;
        }
    }

