sulaolab/dspic33ak-i2c-hal/src/dspic33ak_i2c.c
    if (dspic33ak_i2c_ll_has_collision(inst)) {
        return DSPIC33AK_I2C_ERR_COLLISION;
    }

    if (dspic33ak_i2c_ll_has_error(inst)) {
        return DSPIC33AK_I2C_ERR_BUS;
    }

    if (check_nack) {
        return check_bus_fault(inst);
    }

    return DSPIC33AK_I2C_OK;
}

/* --------------------------------------------------------------------------
 * Adapter: host state machine active condition
 * -------------------------------------------------------------------------- */
static bool host_active(dspic33ak_i2c_instance_t inst)
{
    const dspic33ak_i2c_regs_t *r;

    if (get_regs(inst, &r) != DSPIC33AK_I2C_OK) {
        return false;
    }

    return dspic33ak_i2c_reg_is_set(r->STAT2, DSPIC33AK_I2C_STAT2_HSTACT);
}

/* --------------------------------------------------------------------------
 * Adapter: write byte ready condition
 * -------------------------------------------------------------------------- */
static bool write_byte_ready(dspic33ak_i2c_instance_t inst)
{
    /*
     * Same hardware bit as write_byte_done(), different phase meaning:
     * before TRN write, TRSTAT clear means the transmit state is ready.
     */
    return !dspic33ak_i2c_ll_write_byte_busy(inst);
}

/* --------------------------------------------------------------------------
 * Adapter: write byte done condition
 * -------------------------------------------------------------------------- */
static bool write_byte_done(dspic33ak_i2c_instance_t inst)
{
    /*
     * Same hardware bit as write_byte_ready(), different phase meaning:
     * after TRN write, TRSTAT clear means the current byte transfer is done.
     */
    return !dspic33ak_i2c_ll_write_byte_busy(inst);
}

/* --------------------------------------------------------------------------
 * Adapter: data/address phase accepted condition
 * -------------------------------------------------------------------------- */
static bool write_data_accepted(dspic33ak_i2c_instance_t inst)
{
    const dspic33ak_i2c_regs_t *r;

    if (get_regs(inst, &r) != DSPIC33AK_I2C_OK) {
        return false;
    }

    return dspic33ak_i2c_reg_is_set(r->STAT1, DSPIC33AK_I2C_STAT1_D_A);
}

/* --------------------------------------------------------------------------
 * Adapter: ACK issue done condition
 * -------------------------------------------------------------------------- */
static bool ack_done(dspic33ak_i2c_instance_t inst)
{
    return !dspic33ak_i2c_ll_ack_busy(inst);
}

/* --------------------------------------------------------------------------
 * Adapter: STOP fully completed condition
 *
 * STAT2.STOPE (the STOP event flag) is set slightly before the hardware clears
 * CON1.PEN (the STOP request bit).  A STOP is only truly finished, and the bus
 * only actually released, once PEN has returned to 0.  Waiting on STOPE alone
 * lets the next transaction issue START (SEN) while PEN is still set; the host
 * ignores SEN during a pending STOP, so START never happens and the transfer
 * times out.  This is invisible at fast bus speeds (PEN clears within a short
 * bit period) but reproducibly breaks slow speeds such as 100 kHz.  Require
 * both STOPE set and PEN clear so callers never start a new transfer on a bus
 * whose STOP has not yet retired.
 * -------------------------------------------------------------------------- */
static bool stop_fully_done(dspic33ak_i2c_instance_t inst)
{
    const dspic33ak_i2c_regs_t *r;

    if (get_regs(inst, &r) != DSPIC33AK_I2C_OK) {
        return false;
    }

    return dspic33ak_i2c_reg_is_set(r->STAT2, DSPIC33AK_I2C_STAT2_STOPE) &&
           !dspic33ak_i2c_reg_is_set(r->CON1, DSPIC33AK_I2C_CON1_PEN);
}

/* --------------------------------------------------------------------------
 * Issue STOP and wait quietly
 * -------------------------------------------------------------------------- */
static dspic33ak_i2c_status_t stop_quiet(dspic33ak_i2c_instance_t inst)
{
    dspic33ak_i2c_status_t st;

    st = dspic33ak_i2c_ll_stop_issue(inst);
    if (st != DSPIC33AK_I2C_OK) {
        return st;
    }

    return wait_until(inst, stop_fully_done, false);
}

/* --------------------------------------------------------------------------
 * Issue START and wait
 * -------------------------------------------------------------------------- */
static dspic33ak_i2c_status_t start_blocking(dspic33ak_i2c_instance_t inst)
{
    dspic33ak_i2c_status_t st;

    st = dspic33ak_i2c_ll_start_issue(inst);
    if (st != DSPIC33AK_I2C_OK) {
        return st;
    }

    return wait_until(inst, dspic33ak_i2c_ll_start_done, false);
}

/* --------------------------------------------------------------------------
 * Issue repeated START and wait
 * -------------------------------------------------------------------------- */
static dspic33ak_i2c_status_t restart_blocking(dspic33ak_i2c_instance_t inst)
{
    dspic33ak_i2c_status_t st;

    st = dspic33ak_i2c_ll_restart_issue(inst);
    if (st != DSPIC33AK_I2C_OK) {
        return st;
    }

    return wait_until(inst, dspic33ak_i2c_ll_restart_done, false);
}

/* --------------------------------------------------------------------------
 * Write one byte and wait
 * -------------------------------------------------------------------------- */
static dspic33ak_i2c_status_t write_byte_blocking(
    dspic33ak_i2c_instance_t inst,
    uint8_t data)
{
    dspic33ak_i2c_status_t st;

    /*
     * Byte write sequence:
     *   1. wait until the transmit state is idle
     *   2. wait until the host state machine owns the bus
     *   3. write TRN
     *   4. wait until the transmit state is complete
     *   5. wait until the module reports address/data phase accepted
     */
    st = wait_until(inst, write_byte_ready, false);
    if (st != DSPIC33AK_I2C_OK) {
        return st;
    }

    st = wait_until(inst, host_active, false);
    if (st != DSPIC33AK_I2C_OK) {
        return st;
    }

    st = dspic33ak_i2c_ll_write_byte_issue(inst, data);
    if (st != DSPIC33AK_I2C_OK) {
        return st;
    }

    st = wait_until(inst, write_byte_done, false);
    if (st != DSPIC33AK_I2C_OK) {
        return st;
    }

    st = wait_until(inst, write_data_accepted, false);
    if (st != DSPIC33AK_I2C_OK) {
        return st;
    }

    if (!dspic33ak_i2c_ll_write_byte_acked(inst)) {
        return DSPIC33AK_I2C_ERR_NACK;
    }

    return DSPIC33AK_I2C_OK;
}

/* --------------------------------------------------------------------------
 * Read one byte, issue ACK/NACK, and wait
 * -------------------------------------------------------------------------- */
static dspic33ak_i2c_status_t read_byte_blocking(
    dspic33ak_i2c_instance_t inst,
    uint8_t *data,
    bool ack)
{
    dspic33ak_i2c_status_t st;

    st = dspic33ak_i2c_ll_read_byte_issue(inst);
    if (st != DSPIC33AK_I2C_OK) {
        return st;
    }

    st = wait_until(inst, dspic33ak_i2c_ll_read_byte_ready, false);
    if (st != DSPIC33AK_I2C_OK) {
        return st;
    }

    st = dspic33ak_i2c_ll_read_byte_get(inst, data);
    if (st != DSPIC33AK_I2C_OK) {
        return st;
    }

    st = dspic33ak_i2c_ll_ack_issue(inst, ack);
    if (st != DSPIC33AK_I2C_OK) {
        return st;
    }

    return wait_until(inst, ack_done, false);
}

/* --------------------------------------------------------------------------
 * Send 7-bit address with R/W bit
 * -------------------------------------------------------------------------- */
static dspic33ak_i2c_status_t send_address_blocking(
    dspic33ak_i2c_instance_t inst,
    uint8_t addr7,
    bool read)
{
    uint8_t addr_byte = (uint8_t)((addr7 << 1) | (read ? 1u : 0u));
    return write_byte_blocking(inst, addr_byte);
}
